Tekla Open API Reference for Tekla Structures 2025
Double.WriteXml Method
 Writes the value as XML to the given writer.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void WriteXml(
	XmlWriter writer
)
Public Sub WriteXml (
	writer As XmlWriter
)
Parameters
writer
Type: System.Xml.XmlWriter
The writer to be used.
Implements
IXmlSerializable.WriteXml(XmlWriter)
See Also
Reference
Double Structure
Tekla.Structures.Datatype Namespace